10/data/attachments/12445bddcac19541.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2f7c1038-5e21-4cc2-b8a3-8c59f27f5cdc</nif:username>
            <nif:friendToBeAdded>Alexis_technology_Friend_67759_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>